In [1]:
import pandas as pd

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo.sample(n=3) #Pass the number of wanted random samples in n= argument

,City,Colors Reported,Shape Reported,State,Time
9445,Redmond,NaN,NaN,WA,6/24/1996 22:30
16023,Silver Spring Twp.,NaN,OVAL,PA,3/8/2000 13:00
17183,Big Horn Mtns,NaN,FIREBALL,WY,8/13/2000 20:00

In [7]:
ufo.sample(n=3, random_state=42) #Set a random stat argument to have always the same random samples

               City Colors Reported Shape Reported State              Time
217    Norridgewock             NaN           DISK    ME   9/15/1952 14:00
12282         Ipava             NaN       TRIANGLE    IL   10/1/1998 21:15
17933     Ellinwood             NaN       FIREBALL    KS  11/13/2000 22:00

In [12]:
train = ufo.sample(frac=0.75, random_state=99) #To specify a fraction of the dataset instead of a number of rows

In [15]:
test = ufo.loc[~ufo.index.isin(train.index), :] #To affect remaining 25% to a test set its necessary to get rows that are not, in the train set. To to so use ~